Revit 2024 API
BuiltInFailures.SketchFailures.ManyCCWLoops Property
 Area defined by sketch must be connected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ManyCCWLoops { get; }
Visual Basic
Public Shared ReadOnly Property ManyCCWLoops As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ManyCCWLoops {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace